
const regs = {

    // 用户名 字母，数字，下划线 6-24位
    username: /^[a-zA-Z0-9_]{6,24}$/,

	// 6 - 24 字母，数字和符号任意两种以上组合
    passwd: /^(?![\d]+$)(?![a-zA-Z]+$)(?![!#$%&*]+$)[\da-zA-Z!#$%&*]{6,24}$/,

	// 汉字
	isChinese: /^[\u4e00-\u9fa5]+$/,

	// 手机号
	mobile: /^(13[0-9]|14[579]|15[0-3,5-9]|16[6]|17[0135678]|18[0-9]|19[89])\\d{8}$/,

	// 身份证号可以为18位或15位，允许最后一位为字母
	idCard: /^(^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$)|(^[1-9]\d{5}\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{2}$)$/,

	//车牌号码为首字母为汉字，第二位是字母，后5位可以为纯数字，数字+字母
	carNo: /(^[\u4E00-\u9FA5]{1}[a-zA-Z0-9]{6}$)|(^[A-Za-z]{2}[A-Za-z0-9]{2}[A-Za-z0-9\u4E00-\u9FA5]{1}[A-Za-z0-9]{4}$)|(^[\u4E00-\u9FA5]{1}[A-Za-z0-9]{5}[挂学警军港澳]{1}$)|(^[A-Za-z]{2}[0-9]{5}$)|(^(08|38){1}[A-Za-z0-9]{4}[A-Za-z0-9挂学警军港澳]{1}$)/,

	// 邮箱
	email: /^[a-z0-9]+([._\\-]*[a-z0-9])*@([a-z0-9]+[-a-z0-9]*[a-z0-9]+.){1,63}[a-z0-9]+$/
};

class Regex {

	test(type, input = '') {
		console.log('type is ', type, ' input is ', input);
		const reg = regs[type];
		if (!type) throw new Error('未找到正确匹配的正则类型');
		if (!reg) throw new Error(`还未配置${ type }正则表达式`);
		return reg.test(input);
	}

}

export default new Regex();